CSI API ETABS v1
cAnalysisResults.BucklingFactor Method
 Reports buckling factors obtained from buckling load cases
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int BucklingFactor(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] Factor
)
Function BucklingFactor (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef Factor As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim Factor As Double()
Dim returnValue As Integer
returnValue = instance.BucklingFactor(NumberResults,
	LoadCase, StepType, StepNum, Factor)
int BucklingFactor(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% Factor
)
abstract BucklingFactor :
        NumberResults : int byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        Factor : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type for each result. For buckling factors, the step type is always Mode
StepNum
Type: System.Double[]
 This is an array that includes the step number for each result. For buckling factors, the step number is always the buckling mode number
Factor
Type: System.Double[]
 This is an array that includes the buckling factors
Return Value
Type: Int32
 Returns zero if the factors are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberResults As Integer
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim Factor() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'get buckling factors
       ret = SapModel.Results.BucklingFactor(NumberResults, LoadCase, StepType, StepNum, Factor)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace